In [1]:
import numpy as np
import pandas as pd

<header>I. Creating DataFrame</header>

In [2]:
# Creating DataFrame Objects
    # Creating a DataFrame using NumPy function results
pd.DataFrame(np.arange(1,6))

   0
0  1
1  2
2  3
3  4
4  5

In [5]:
df = pd.DataFrame(np.array([[10,11],[20,21]]))
df

    0   1
0  10  11
1  20  21

In [12]:
# Show column index: df.columns
df = pd.DataFrame(np.array([[70, 71],[90,91]]), columns=['Missoula','Philadelphia'])
df.columns

Index(['Missoula', 'Philadelphia'], dtype='object')

In [7]:
len(df)

2

In [8]:
df.shape

(2, 2)

In [13]:
#Creating a DataFrame using dictionary
temp_missoula = [70, 71]
temp_philly = [90, 91]
temperature = {'Missoula': temp_missoula, 'Philly': temp_philly}
pd.DataFrame(temperature)

   Missoula  Philly
0        70      90
1        71      91

In [15]:
#Creating a DataFrame using Pandas Series
temps_1 = pd.Series([70, 90])
temps_2 = pd.Series([71, 91])
df = pd.DataFrame([temps_1, temps_2])
df

    0   1
0  70  90
1  71  91

In [17]:
    #Assign columns names
df.columns = ['Missoula','Philadelphia']
df

   Missoula  Philadelphia
0        70            90
1        71            91

In [18]:
#Creating a DataFrame using CSV file
sp500 = pd.read_csv("sp500.csv", index_col='Symbol', usecols= [0, 2, 3, 7])
    #read columns in position [0,2,3,7]
    #use symble columns as index
    #Reading first five rows using .head()

In [19]:
sp500.head()

                        Sector   Price  Book Value
Symbol
MMM                Industrials  141.14      26.668
ABT                Health Care   39.60      15.573
ABBV               Health Care   53.95       2.954
ACN     Information Technology   79.79       8.326
ACE                 Financials  102.91      86.897

In [20]:
len(sp500)

500

In [22]:
sp500.shape

(500, 3)

In [23]:
sp500.size

1500

In [24]:
    #examine the index of rows
sp500.index

Index(['MMM', 'ABT', 'ABBV', 'ACN', 'ACE', 'ACT', 'ADBE', 'AES', 'AET', 'AFL',
       ...
       'XEL', 'XRX', 'XLNX', 'XL', 'XYL', 'YHOO', 'YUM', 'ZMH', 'ZION', 'ZTS'],
      dtype='object', name='Symbol', length=500)

In [25]:
sp500.columns

Index(['Sector', 'Price', 'Book Value'], dtype='object')

<Header>II. Accessing data within a DataFrame: using [], .loc[], and .iloc[]</Header>

In [26]:
   #Retrieves the column with name Sector
sp500['Sector'].head()
sp500.Sector

Symbol
MMM                Industrials
ABT                Health Care
ABBV               Health Care
ACN     Information Technology
ACE                 Financials
                 ...
YHOO    Information Technology
YUM     Consumer Discretionary
ZMH                Health Care
ZION                Financials
ZTS                Health Care
Name: Sector, Length: 500, dtype: object

In [27]:
    #Check type of Sector
type(sp500['Sector']) # when a single column is restrived from Dataframe, the result is Series

pandas.core.series.Series

In [28]:
    #Selecting rows of a DataFrame
sp500.loc['MMM'] #select row having index name (row index) ['MMM']

Sector        Industrials
Price              141.14
Book Value         26.668
Name: MMM, dtype: object

In [30]:
    #Select multiple rows base on multiple names
sp500.loc[['MMM', 'MSFT']]

                        Sector   Price  Book Value
Symbol
MMM                Industrials  141.14      26.668
MSFT    Information Technology   40.12      10.584

In [31]:
#Select rows by using index iloc
sp500.iloc[[0, 2]] #get rows in location 0, 2 (row 0 and 2)

             Sector   Price  Book Value
Symbol
MMM     Industrials  141.14      26.668
ABBV    Health Care   53.95       2.954

In [34]:
    #get the index of row 'MMM' an 'A'
i1 = sp500.index.get_loc('MMM')
i2 = sp500.index.get_loc('A')
(i1, i2) #output:(0,10)

(0, 10)

In [35]:
#use that index (0,10) to retrive the row
sp500.iloc[[i1, i2]]

             Sector   Price  Book Value
Symbol
MMM     Industrials  141.14      26.668
A       Health Care   56.18      16.928

In [36]:
    #.at[]; iat[] find the value base on the location: .at[row = index name, column = column name]
sp500.at['MMM', 'Price'] #index 'MMM'; column 'Price'

141.14

In [37]:
sp500.iat[0,1] #index row location: 0; column location: 1;

141.14

<Header>II. Slicing using the [] operator</Header>

In [39]:
#Slicing using the [] operator
sp500[:5] #first five rows

                        Sector   Price  Book Value
Symbol
MMM                Industrials  141.14      26.668
ABT                Health Care   39.60      15.573
ABBV               Health Care   53.95       2.954
ACN     Information Technology   79.79       8.326
ACE                 Financials  102.91      86.897

In [40]:
#Slice from rows has index 'ABT' to rows has index 'ACN'
sp500['ABT': 'ACN']

                        Sector  Price  Book Value
Symbol
ABT                Health Care  39.60      15.573
ABBV               Health Care  53.95       2.954
ACN     Information Technology  79.79       8.326

<Header>III. Select rows using Boolen selection</Header>

In [41]:
### identifies all stocks with a price less than 100:  ###
sp500.Price < 100

Symbol
MMM     False
ABT      True
ABBV     True
ACN      True
ACE     False
        ...
YHOO     True
YUM      True
ZMH     False
ZION     True
ZTS      True
Name: Price, Length: 500, dtype: bool

In [43]:
### Multiple condition put together using parentheses.
r = sp500[(sp500.Price <10) & (sp500.Price > 6)]['Price'] #get only the price where Price is <10 and >6
r

Symbol
HCBK    9.80
HBAN    9.10
SLM     8.82
WIN     9.38
Name: Price, dtype: float64